balazsgrill/modembed/res/Devices/dsPIC30/PIC24F04KA201.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="24xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="PIC24F04KA201" edc:procid="0x0072" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power edc:hashighvoltagemclr="true">
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="2.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="2.000" edc:minvoltage="2.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:haschecksum="true" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="10000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="32" edc:rowerase="128"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="24xxxx" edc:name="24xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap Vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address Error Trap Vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap Vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap Vector"/>
    <edc:Trap edc:cname="ReservedTrap5" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Capture 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1E - SPI1 Error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="ADC1Interrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="13"/>
    <edc:Interrupt edc:cname="NVMWriteInterrupt" edc:desc="NVM Write Complete Interrupt" edc:irq="15"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CompInterrupt" edc:desc="Comp - Comparator" edc:irq="18"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="CN -  Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="U1E - UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="HLVDInterrupt" edc:desc="HLVD - High Low Voltage Detect" edc:irq="72"/>
    <edc:Interrupt edc:cname="CTMUInterrupt" edc:desc="CTMU - Interrupt" edc:irq="77"/>
  </edc:InterruptList>
  <edc:CodeGuard>
    <edc:SegRegion edc:segregion="Program">
      <edc:Seg edc:seg="General">
        <edc:SegNature edc:addr="0xAFE" edc:id="PgmGenOn" edc:segsecurity="Standard" edc:segsize="None"/>
        <edc:SegNature edc:addr="0xAFE" edc:id="PgmGenOff" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmGenWrtProtectOff" edc:enableid="PgmGenWrtProtectOn"/>
      </edc:Seg>
    </edc:SegRegion>
  </edc:CodeGuard>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x3" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x100" edc:regionid="ivt"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0xb00" edc:regionid="program"/>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8007c0" edc:beginaddr="0x800000" edc:endaddr="0x800800" edc:regionid="testmem"/>
    <edc:DeviceIDSector edc:beginaddr="0xff0000" edc:endaddr="0xff0004" edc:mask="0xffff0000" edc:regionid="devid" edc:value="0xD000000"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x800000" edc:endaddr="0x800008" edc:regionid="debug"/>
    <edc:ConfigFuseSector edc:beginaddr="0xf80000" edc:endaddr="0xf80012" edc:regionid="cfgmem">
      <edc:DCRDef edc:access="------------nnnn" edc:cname="FBS" edc:default="0x000f" edc:desc="" edc:impl="0xf" edc:islanghidden="true" edc:name="FBS" edc:nzwidth="16" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x000f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Reserved" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="2"/>
      <edc:DCRDef edc:access="--------------nn" edc:cname="FGS" edc:default="0x0003" edc:desc="" edc:impl="0x3" edc:name="FGS" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x0003">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Segment Code Flash Write Protection bit" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="General segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="General segment is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GCP" edc:desc="General Segment Code Flash Code Protection bit" edc:mask="0x1" edc:name="GCP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenOff" edc:desc="No protection" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenOn" edc:desc="Standard security enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x80" edc:endaddr="0xaff"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
